bikeonur/app/controllers/users_controller.rb

INSERT INTO `users` (`data`, `created_at`, `updated_at`, `session_id`, `enabled`, `login`, `password`, `email`, `authorization_token`, `active`) VALUES(NULL, '2010-01-16 21:36:45', '2010-01-16 21:36:45', NULL, NULL, 'nao', 'test', 'nao@test.pl', NULL, NULL)
---
  def register
    @title = "Rejestracje"
     if param_posted?(:user)
      @user = User.new(params[:user])
      if @user.save

SELECT * FROM `users` WHERE (`users`.`password` = 'test' AND `users`.`login` = 'nao') LIMIT 1
---
  def login
    @title = "Logowanie"
     if request.get?
      @user = User.new(:remember_me => remember_me_string)
    elsif param_posted?(:user)
      @user = User.new(params[:user])
      user = User.find_by_login_and_password(@user.login,
                                                   @user.password)